[{
    "id": 1,
    "text": "Make a list of tools. People on Twitter are suckers for tools list. I don't know what it is but we are always looking for new tools to play with. A few ideas: * Make a list of tools you are currently using * Make a list of tools you are wishing to try * Make a list of tools for one specific niche (eg Twitter creators) Plus, putting it into a list format is an easy way to make sure your tweet is being read"
},
{
    "id": 6,
    "text": "Harsh/Hidden truths. Harsh or hidden truths are usually tweets that get a lot of engagement, since people love an opinion to share their thoughts. In your content niche, what is the one thing you are not sure people will agree with?"
},
{
    "id": 3,
    "text": "Make a step-by-step list. Lists are also great to showcase the steps that go into something. Use it to: * Explain how you do something * Explain how someone else is doing something"
},
{
    "id": 7,
    "text": "Share a “life hack”. Is there something everyone tells you \"wow, I didn't know you could do that\" when you do it? Share it on Twitter. There is a good chance that more people will find it interesting"
},
{
    "id": 8,
    "text": "Tell people what they are doing wrong. Then offer an alternative. I'm sure you've seen plenty of tweets that start with “Stop doing (this one thing). Do (this other thing) instead”. That's another tweet idea for you. Pick one thing so many people do wrong. Tell them what the alternative is, according to you."
},
{
    "id": 9,
    "text": "Share a milestone. Let people know you've reached a significant milestone! Some people celebrate reaching a certain number of followers, or making a certain amount of revenue, or finishing a certain number of books..."
},
{
    "id": 10,
    "text": "Share something you are struggling with. There is a good chance that someone else is facing the same problem as you. Share that and you might just find someone who can help you."
},
{
    "id": 12,
    "text": "Challenge your audience. The idea is simple: challenge your audience by asking their opinion on a topic related to your niche. The key is to limit their options for responding. What do I mean by that? Ask them to answer your question in one word or one sentence. This type of tweet is guaranteed to get higher engagement. An example: “in one word, what's your best Twitter tip?”"
},
{
    "id": 15,
    "text": "Ask people if they agree or disagree with something. This is how you should do it: 1. Make a statement (For example, Lebron James is the GOAT) 2. Ask people if they agree or disagree with it. 3. See what happens"
},
{
    "id": 19,
    "text": "Ask people to complete your tweet. Write a “fill in the blanks” type of tweet and let your audience complete it for you. This is a fun game that often generates a huge amount of engagement."
}]
